#### ServerChangeCause Enumeration

---

|  |
| --- |
| See Also |

Indicates the cause for the active server to be changed

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ServerChangeCause ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ServerChangeCause ``` |

| Visual C++ |
| --- |
| ``` public enum class ServerChangeCause ``` |

# Members

| Member name | Description |
| --- | --- |
| ImposedChange | The active server is being changed as a result of other operations in Revit. |
| UserChange | The change of the active server has been explicitly requested by the end user. |

# See Also

Autodesk.Revit.DB.ExternalService Namespace